IDEA Open Model
Element1D.EccentricityEndX Property
Compatible with IDEA StatiCa v 10.1
 Local eccentricity X at the end of Element1D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public double EccentricityEndX { get; set; }
Public Property EccentricityEndX As Double
	Get
	Set
public:
property double EccentricityEndX {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
Element1D Class
IdeaRS.OpenModel.Model Namespace